IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l11xx_l13xx/SYSCTL_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="SYSCTL" HW_revision="1.0">
    <register id="SYSCTL_IIDX" width="32" offset="0x1020" description="SYSCTL interrupt index">
        <bitfield id="STAT" description="The SYSCTL interrupt index (IIDX) register generates a value corresponding to the highest priority pending interrupt source.  This value may be used as an address offset for fast, deterministic handling in the interrupt service routine.  A read of the IIDX register will clear the corresponding interrupt status in the RIS and MIS registers." begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
            <bitenum id="LFOSCGOOD" value="0x1" description="LFOSCGOOD interrupt pending"/>
            <bitenum id="ANACLKERR" value="0x2" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_IMASK" width="32" offset="0x1028" description="SYSCTL interrupt mask">
        <bitfield id="LFOSCGOOD" description="Enable or disable the LFOSCGOOD interrupt. LFOSCGOOD indicates that the LFOSC has started successfully." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ANACLKERR" description="Analog Clocking Consistency Error" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_RIS" width="32" offset="0x1030" description="SYSCTL raw interrupt status">
        <bitfield id="LFOSCGOOD" description="Raw status of the LFOSCGOOD interrupt." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="No interrupt pending"/>
            <bitenum id="TRUE" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ANACLKERR" description="Analog Clocking Consistency Error" begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description=""/>
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MIS" width="32" offset="0x1038" description="SYSCTL masked interrupt status">
        <bitfield id="LFOSCGOOD" description="Masked status of the LFOSCGOOD interrupt." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="No interrupt pending"/>
            <bitenum id="TRUE" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ANACLKERR" description="Analog Clocking Consistency Error" begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description=""/>
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_ISET" width="32" offset="0x1040" description="SYSCTL interrupt set">
        <bitfield id="LFOSCGOOD" description="Set the LFOSCGOOD interrupt." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0h hs no effect"/>
            <bitenum id="SET" value="0x1" description="Set interrupt"/>
        </bitfield>
        <bitfield id="ANACLKERR" description="Analog Clocking Consistency Error" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description=""/>
            <bitenum id="SET" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_ICLR" width="32" offset="0x1048" description="SYSCTL interrupt clear">
        <bitfield id="LFOSCGOOD" description="Clear the LFOSCGOOD interrupt." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0h has no effect"/>
            <bitenum id="CLR" value="0x1" description="Clear interrupt"/>
        </bitfield>
        <bitfield id="ANACLKERR" description="Analog Clocking Consistency Error" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description=""/>
            <bitenum id="CLR" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_NMIIIDX" width="32" offset="0x1050" description="NMI interrupt index">
        <bitfield id="STAT" description="The NMI interrupt index (NMIIIDX) register generates a value corresponding to the highest priority pending NMI source.  This value may be used as an address offset for fast, deterministic handling in the NMI service routine.  A read of the NMIIIDX register will clear the corresponding interrupt status in the NMIRIS register." begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="NO_INTR" value="0x0" description="No NMI pending"/>
            <bitenum id="BORLVL" value="0x1" description="BOR Threshold NMI pending"/>
            <bitenum id="WWDT0" value="0x2" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_NMIRIS" width="32" offset="0x1060" description="NMI raw interrupt status">
        <bitfield id="BORLVL" description="Raw status of the BORLVL NMI" begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="No interrupt pending"/>
            <bitenum id="TRUE" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="WWDT0" description="Watch Dog 0 Fault" begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description=""/>
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_NMIISET" width="32" offset="0x1070" description="NMI interrupt set">
        <bitfield id="BORLVL" description="Set the BORLVL NMI" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0h hs no effect"/>
            <bitenum id="SET" value="0x1" description="Set interrupt"/>
        </bitfield>
        <bitfield id="WWDT0" description="Watch Dog 0 Fault" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description=""/>
            <bitenum id="SET" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_NMIICLR" width="32" offset="0x1078" description="NMI interrupt clear">
        <bitfield id="BORLVL" description="Clr the BORLVL NMI" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0h hs no effect"/>
            <bitenum id="CLR" value="0x1" description="Clear interrupt"/>
        </bitfield>
        <bitfield id="WWDT0" description="Watch Dog 0 Fault" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description=""/>
            <bitenum id="CLR" value="0x1" description=""/>
        </bitfield>
    </register>
