IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l11xx_l13xx/SYSCTL_1.0.xml
    <register id="SYSCTL_SYSSTATUSCLR" width="32" offset="0x1324" description="Clear sticky bits of SYSSTATUS">
        <bitfield id="ALLECC" description="Set ALLECC to clear all ECC related SYSSTATUS indicators." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CLEAR" value="0x1" description="Clear ECC error state"/>
        </bitfield>
    </register>
    <register id="SYSCTL_SWDCFG" width="32" offset="0x1328" description="Disable the SWD function on the SWD pins">
        <bitfield id="DISABLE" description="Set DISABLE to disable the SWD function on SWD pins, allowing the SWD pins to be used as GPIO." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRUE" value="0x1" description="Disable SWD function on SWD pins"/>
        </bitfield>
    </register>
    <register id="SYSCTL_FCCCMD" width="32" offset="0x132C" description="Frequency clock counter start capture">
        <bitfield id="GO" description="Set GO to start a capture with the frequency clock counter (FCC)." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_PMUOPAMP" width="32" offset="0x1380" description="GPAMP control">
        <bitfield id="RRI" description="RRI selects the rail-to-rail input mode." begin="5" end="4" width="2" rwaccess="R/W">
            <bitenum id="MODE0" value="0x0" description="PMOS input pairs"/>
            <bitenum id="MODE1" value="0x1" description="NMOS input pairs"/>
            <bitenum id="MODE2" value="0x2" description="Rail-to-rail mode"/>
            <bitenum id="MODE3" value="0x3" description="Sample channel 0"/>
        </bitfield>
        <bitfield id="NSEL" description="NSEL selects the GPAMP negative channel input." begin="3" end="2" width="2" rwaccess="R/W">
            <bitenum id="SEL0" value="0x0" description="GPAMP_OUT pin connected to negative channel"/>
            <bitenum id="SEL1" value="0x1" description="GPAMP_IN- pin connected to negative channel"/>
            <bitenum id="SEL2" value="0x2" description="GPAMP_OUT signal connected to negative channel"/>
            <bitenum id="SEL3" value="0x3" description="No channel selected"/>
        </bitfield>
        <bitfield id="CHOPCLKMODE" description="CHOPCLKMODE selects the GPAMP chopping mode." begin="11" end="10" width="2" rwaccess="R/W">
            <bitenum id="CHOPDISABLED" value="0x0" description="Chopping disabled"/>
            <bitenum id="REGCHOP" value="0x1" description="Normal chopping"/>
            <bitenum id="ADCASSIST" value="0x2" description="ADC Assisted chopping"/>
            <bitenum id="RESERVED" value="0x3" description="Reserved"/>
        </bitfield>
        <bitfield id="OUTENABLE" description="Set OUTENABLE to connect the GPAMP output signal to the GPAMP_OUT pin" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="FALSE" value="0x0" description="GPAMP_OUT signal is not connected to the GPAMP_OUT pin"/>
            <bitenum id="TRUE" value="0x1" description="GPAMP_OUT signal is connected to the GPAMP_OUT pin"/>
        </bitfield>
        <bitfield id="ENABLE" description="Set ENABLE to turn on the GPAMP." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="FALSE" value="0x0" description="GPAMP is disabled"/>
            <bitenum id="TRUE" value="0x1" description="GPAMP is enabled"/>
        </bitfield>
        <bitfield id="CHOPCLKFREQ" description="CHOPCLKFREQ selects the GPAMP chopping clock frequency" begin="9" end="8" width="2" rwaccess="R/W">
            <bitenum id="CLK16KHZ" value="0x0" description="16kHz"/>
            <bitenum id="CLK8KHZ" value="0x1" description="8kHz"/>
            <bitenum id="CLK4KHZ" value="0x2" description="4kHz"/>
            <bitenum id="CLK2KHZ" value="0x3" description="2kHz"/>
        </bitfield>
        <bitfield id="PCHENABLE" description="Set PCHENABLE to enable the positive channel input." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="FALSE" value="0x0" description="Positive channel disabled"/>
            <bitenum id="TRUE" value="0x1" description="GPAMP_IN+ connected to positive channel"/>
        </bitfield>
    </register>
    <register id="SYSCTL_SHUTDNSTORE0" width="32" offset="0x1400" description="Shutdown storage memory (byte 0)">
        <bitfield id="DATA" description="Shutdown storage byte 0" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SHUTDNSTORE1" width="32" offset="0x1404" description="Shutdown storage memory (byte 1)">
        <bitfield id="DATA" description="Shutdown storage byte 1" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SHUTDNSTORE2" width="32" offset="0x1408" description="Shutdown storage memory (byte 2)">
        <bitfield id="DATA" description="Shutdown storage byte 2" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SHUTDNSTORE3" width="32" offset="0x140C" description="Shutdown storage memory (byte 3)">
        <bitfield id="DATA" description="Shutdown storage byte 3" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ADC12B1MSPS0_PWREN" width="32" offset="0x4800" description="IP Enable Register">
        <bitfield id="ENABLE" description="IP Enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ADC12B1MSPS0_RSTCTL" width="32" offset="0x4804" description="Power Control Register - Write Only Register, Always Read as 0">
        <bitfield id="RESETSTKYCLR" description="Clear the RESET STICKY Bit" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="Clear" value="0x1" description=""/>
        </bitfield>
        <bitfield id="RESETASSERT" description="Assert Reset to IP Domain." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Do" value="0x1" description=""/>
        </bitfield>
    </register>
