IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l11xx_l13xx/SYSCTL_1.0.xml
    <register id="SYSCTL_MGMT_VREF_RSTCTL" width="32" offset="0x30804" description="Power Control Register - Write Only Register, Always Read as 0">
        <bitfield id="RESETSTKYCLR" description="Clear the RESET STICKY Bit" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="Clear" value="0x1" description=""/>
        </bitfield>
        <bitfield id="RESETASSERT" description="Assert Reset to IP Domain." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Do" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_VREF_STAT" width="32" offset="0x30814" description="IP State Register - Read Only">
        <bitfield id="RESETSTKY" description="IP has been Reset" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="clear" value="0x0" description=""/>
            <bitenum id="Set" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_WWDTLP0_PWREN" width="32" offset="0x80800" description="IP Enable Register">
        <bitfield id="ENABLE" description="IP Enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_WWDTLP0_RSTCTL" width="32" offset="0x80804" description="Power Control Register - Write Only Register, Always Read as 0">
        <bitfield id="RESETSTKYCLR" description="Clear the RESET STICKY Bit" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="Clear" value="0x1" description=""/>
        </bitfield>
        <bitfield id="RESETASSERT" description="Assert Reset to IP Domain." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Do" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_WWDTLP0_STAT" width="32" offset="0x80814" description="IP State Register - Read Only">
        <bitfield id="RESETSTKY" description="IP has been Reset" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="clear" value="0x0" description=""/>
            <bitenum id="Set" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_GPTIMER16B2CCLP0_PWREN" width="32" offset="0x84800" description="IP Enable Register">
        <bitfield id="ENABLE" description="IP Enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_GPTIMER16B2CCLP0_RSTCTL" width="32" offset="0x84804" description="Power Control Register - Write Only Register, Always Read as 0">
        <bitfield id="RESETSTKYCLR" description="Clear the RESET STICKY Bit" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="Clear" value="0x1" description=""/>
        </bitfield>
        <bitfield id="RESETASSERT" description="Assert Reset to IP Domain." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Do" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_GPTIMER16B2CCLP0_STAT" width="32" offset="0x84814" description="IP State Register - Read Only">
        <bitfield id="RESETSTKY" description="IP has been Reset" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="clear" value="0x0" description=""/>
            <bitenum id="Set" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_GPTIMER16B2CCLP1_PWREN" width="32" offset="0x86800" description="IP Enable Register">
        <bitfield id="ENABLE" description="IP Enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_GPTIMER16B2CCLP1_RSTCTL" width="32" offset="0x86804" description="Power Control Register - Write Only Register, Always Read as 0">
        <bitfield id="RESETSTKYCLR" description="Clear the RESET STICKY Bit" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="Clear" value="0x1" description=""/>
        </bitfield>
        <bitfield id="RESETASSERT" description="Assert Reset to IP Domain." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Do" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_GPTIMER16B2CCLP1_STAT" width="32" offset="0x86814" description="IP State Register - Read Only">
        <bitfield id="RESETSTKY" description="IP has been Reset" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="clear" value="0x0" description=""/>
            <bitenum id="Set" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_GPTIMER16B2CCLP2_PWREN" width="32" offset="0x88800" description="IP Enable Register">
        <bitfield id="ENABLE" description="IP Enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_GPTIMER16B2CCLP2_RSTCTL" width="32" offset="0x88804" description="Power Control Register - Write Only Register, Always Read as 0">
        <bitfield id="RESETSTKYCLR" description="Clear the RESET STICKY Bit" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="Clear" value="0x1" description=""/>
        </bitfield>
        <bitfield id="RESETASSERT" description="Assert Reset to IP Domain." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Do" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_GPTIMER16B2CCLP2_STAT" width="32" offset="0x88814" description="IP State Register - Read Only">
        <bitfield id="RESETSTKY" description="IP has been Reset" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="clear" value="0x0" description=""/>
            <bitenum id="Set" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_GPTIMER16B2CCSPLP0_PWREN" width="32" offset="0x8C800" description="IP Enable Register">
        <bitfield id="ENABLE" description="IP Enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_GPTIMER16B2CCSPLP0_RSTCTL" width="32" offset="0x8C804" description="Power Control Register - Write Only Register, Always Read as 0">
        <bitfield id="RESETSTKYCLR" description="Clear the RESET STICKY Bit" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="Clear" value="0x1" description=""/>
        </bitfield>
        <bitfield id="RESETASSERT" description="Assert Reset to IP Domain." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Do" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_GPTIMER16B2CCSPLP0_STAT" width="32" offset="0x8C814" description="IP State Register - Read Only">
        <bitfield id="RESETSTKY" description="IP has been Reset" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="clear" value="0x0" description=""/>
            <bitenum id="Set" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_GPIO0_PWREN" width="32" offset="0xA0800" description="IP Enable Register">
        <bitfield id="ENABLE" description="IP Enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_GPIO0_RSTCTL" width="32" offset="0xA0804" description="Power Control Register - Write Only Register, Always Read as 0">
        <bitfield id="RESETSTKYCLR" description="Clear the RESET STICKY Bit" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="Clear" value="0x1" description=""/>
        </bitfield>
        <bitfield id="RESETASSERT" description="Assert Reset to IP Domain." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Do" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_GPIO0_STAT" width="32" offset="0xA0814" description="IP State Register - Read Only">
        <bitfield id="RESETSTKY" description="IP has been Reset" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="clear" value="0x0" description=""/>
            <bitenum id="Set" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_I2C0_PWREN" width="32" offset="0xF0800" description="IP Enable Register">
        <bitfield id="ENABLE" description="IP Enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
    </register>
