IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l11xx_l13xx/SYSCTL_1.0.xml
    <register id="SYSCTL_MGMT_SPI0_PWREN" width="32" offset="0x468800" description="IP Enable Register">
        <bitfield id="ENABLE" description="IP Enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_SPI0_RSTCTL" width="32" offset="0x468804" description="Power Control Register - Write Only Register, Always Read as 0">
        <bitfield id="RESETSTKYCLR" description="Clear the RESET STICKY Bit" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="Clear" value="0x1" description=""/>
        </bitfield>
        <bitfield id="RESETASSERT" description="Assert Reset to IP Domain." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Do" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_SPI0_CLKCFG" width="32" offset="0x468808" description="IP Clock Configuration Register">
        <bitfield id="BLOCKASYNC" description="Async Clock Request is blocked from starting SYSOSC or forcing bus clock to 32MHz" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_SPI0_STAT" width="32" offset="0x468814" description="IP State Register - Read Only">
        <bitfield id="RESETSTKY" description="IP has been Reset" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="clear" value="0x0" description=""/>
            <bitenum id="Set" value="0x1" description=""/>
        </bitfield>
    </register>
</module>
